# run_once_generate_images.py
from utils import extract_univ_pages
keywords = [
    '가천대', '가톨릭대', '감신대', '강남대', '강서대', '강원대', '건국대', '경기대',
    '경동대', '경북대', '경상국립대', '경인교대', '경희대', '고려대', '공주교대', '공주대',
    '광운대', '광주교대', '국민대', '극동대', '단국대', '대구교대', '대진대', '덕성여대',
    '동국대', '동덕여대', '동양대', '루터대', '명지대', '부산교대', '부산대', '삼육대',
    '상명대', '서강대', '서경대', '서울과기대', '서울교대', '서울기독대', '서울대',
    '서울시립대', '서울신학대', '서울여대', '서울장신대', '서울한영대', '선문대', '성결대',
    '성공회대', '성균관대', '성신여대', '세명대', '세종대', '수원가톨릭대', '수원대',
    '숙명여대', '순천향대', '숭실대', '신한대', '아신대', '아주대', '안양대', '연세대',
    '용인대', '우송대', '울산대', '원광대', '을지대', '이화여대', '인천가톨릭대', '인천대',
    '인하대', '장신대', '전남대', '전북대', '전주교대', '제주대', '조선대', '중앙대',
    '중앙승가대', '진주교대', '차의과학대', '청주교대', '총신대', '추계예술대', '춘천교대',
    '충남대', '충북대', '칼빈대', '평택대', '포항공대', '한경국립대', '한국공학대',
    '한국교원대', '한국교통대', '한국기술교대', '한국성서대', '한국외대', '한국체육대',
    '한국항공대', '한남대', '한동대', '한라대', '한림대', '한밭대', '한서대', '한성대',
    '한세대', '한신대', '한양대', '협성대', '호남대', '호서대', '홍익대', '화성의과학대'
]
 # 원하는 대학들 추가 가능

extract_univ_pages("data/input.pdf", "data/images", keywords)
print("✅ 이미지 생성 완료!")